Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_offences/index.html.txt.tmx
Source language: en
Languages: ga

source: Classification of crimes in criminal cases
ga: Coireanna a aicmiú i gcúiseanna coiriúla

source: The way in which a criminal offence is investigated and prosecuted depends on the type of crime involved
ga: Déantar imscrúdú ar chion coiriúil agus déantar é a ionchúiseamh bunaithe ar an gcineál coire atá i gceist

source: For these purposes criminal offences may be described in different ways
ga: Chun na críche seo, féadtar cionta coiriúla a aicmiú i slite difriúla

source: The law on public order offences is mainly set down in the Criminal Justice (Public Order) Act, 1994
ga: Tá an chuid is mó den dlí a bhaineann le cionta oird phoiblí leagtha amach san Acht um Cheartas Coiriúil (Ord Poiblí), 1994

source: Find out more about the different types of offences
ga: Faigh amach níos mó faoi na cineálacha difriúla cionta

source: In Ireland the Misuse of Drugs Act 1977 as amended by other legislation is the principal legislation that covers drug offences and the respective penalties
ga: In Éirinn is é an tAcht um Mí-Úsáid Drugaí 1977, arna leasú le reachtaíocht eile, an phríomhreachtaíocht a bhaineann le cionta drugaí agus leis na pionóis faoi seach

source: Alcohol and the law
ga: Alcól agus an dlí

source: Laws in place regarding the serving of alcohol on licensed premises and off-licences, drinking in public and drink driving
ga: Pléann an cháipéis seo an dlí maidir le alcól a dhíol in áitribh chéadúnaithe agus siopaí eischeadúnais, ól in áiteanna poiblí agus tiomáint faoi thionchar alcóil

source: Drink driving is a very serious offence
ga: Cion an-tromchúiseach is ea an tiomáint ar meisce

source: Find out about the law on drink driving, including random breath testing, powers of the Gardai and procedures if you are arrested
ga: Faigh amach faoin dlí maidir le tiomáint ar meisce, lena n-áirítear an tástáil randamach anála, cumhachtaí an Gharda Síochána agus nósanna imeachta má ghabhtar tú

source: This document is in: Travel and Recreation > Motoring > Driving offences
ga: This document is in: Taisteal agus Áineas > Gluaisteánaíocht > Cionta tiomána

source: Find out about the penalties in place if you are convicted of a driving offence
ga: Tá eolas anseo maidir leis na pionóis a ghearrtar má fhaightear ciontach tú i gCoir Tiomána

source: The law on fireworks
ga: An dlí maidir le tinte ealaíne

source: In 2006 the law in relation to fireworks changed
ga: D'athraigh an dlí maidir le tinte ealaíne i 2006

source: The Gardaí now have the power to make arrests in relation to the possession of unlicensed fireworks
ga: Tá an chumhacht ag na Gardaí anois daoine a ghabháil maidir le tinte ealaíne a bheith ina seilbh acu gan cheadúnas

source: Find out more here
ga: Faigh tuilleadh eolais anseo

source: Most Read in "Justice"
ga: Ábhar is mó éilimh i "Dlí"
